Dlubal.RFEM5.IProtocol
Interface for working with a printout report.

Dlubal.RFEM5.IProtocol.GetHeaderOptions
Gets options of the printout report displayed header.
Returns: Printout report header options.

Dlubal.RFEM5.IProtocol.GetDate
Gets printout report date displayed in the header.
Returns: Printout report date.

Dlubal.RFEM5.IProtocol.GetNumbering
Gets page and sheet numbering.
Returns: Page and sheet numbering.

Dlubal.RFEM5.IProtocol.GetCompany
Gets company information defined in the printout report.
Returns: Company information.